InformationRegisters/ПроксиСервера_Приоритеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ПроксиСервера_Приоритеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриоритетТелеграм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроксиСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроксиСервера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПроксиСервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ПроксиСервера</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МожноИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПроксиСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПроксиСервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Протокол</Name>
					<Comment>Протокол для которого можно использовать, если не заполнено то для всех (вводить один протокол маленькими буквами, без проболев)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ВебОбщий/Ext/Module.bsl
// НайтиПодходящийПрокси - находит рабочий прокси сервер для указанного протокола 
// Возвращает: Ссылку на справочник ПроксиСервера (Пустая ссылка если ничего не найдено)
// Параметры:
// Протокол - Строка(Необязательный) - Имя нужного протокола(Если не задано, то будет подбираться универсальный прокси, для всех протоколов) 
Функция НайтиДанныеПодходящегоПрокси(Протокол = "Все") Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПроксиСервера.Ссылка КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.ПроксиСервера_Приоритеты КАК ПроксиСервера_Приоритеты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПроксиСервера КАК ПроксиСервера
	               |		ПО ПроксиСервера_Приоритеты.ПроксиСервер = ПроксиСервера.Ссылка
	               |ГДЕ
	               |	ПроксиСервера_Приоритеты.ПриоритетТелеграм > 0
	               |	И ПроксиСервера.МожноИспользовать
	               |	И ПроксиСервера.Протокол В(&Протоколы)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПроксиСервера_Приоритеты.ПриоритетТелеграм УБЫВ";
	Протоколы = Новый Массив();
	Протоколы.Добавить("Все");                             
	Протоколы.Добавить(Протокол);
	Запрос.УстановитьПараметр("Протоколы", Протоколы);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДанныеПрокси = Выборка.Ссылка;
	Иначе
		ДанныеПрокси = Справочники.ПроксиСервера.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ДанныеПрокси;	
	
КонецФункции

// ПолучитьПодходящийПрокси - находит рабочий прокси сервер для указанного протокола 
// Возвращает: ИнтернетПрокси(), Неопределено
// Параметры:
// Протокол - Строка(Необязательный) - Имя нужного протокола (Например http, https)) 
Функция ПолучитьПодходящийПрокси(Протокол) Экспорт

	ДанныеПрокси = НайтиДанныеПодходящегоПрокси(Протокол);
	Если ЗначениеЗаполнено(ДанныеПрокси) Тогда
		Прокси = Новый ИнтернетПрокси();
		Прокси.Пользователь = ДанныеПрокси.Пользователь;
		Прокси.Пароль = ДанныеПрокси.Пароль;
		Прокси.Установить(Протокол, ДанныеПрокси.АдресПроксиСервера, ДанныеПрокси.ПортПроксиСервера);
	Иначе
		Прокси = Неопределено;
	КонецЕсли;

	Возврат Прокси;
	
КонецФункции


Процедура ИзменитьПриоритетПрокси(ПроксиСервер, Дельта) Экспорт
	
	Попытка
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		Блокировка = Новый БлокировкаДанных;
	    ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПроксиСервера_Приоритеты");
	    ЭлементБлокировки.УстановитьЗначение("ПроксиСервер", ПроксиСервер);
	    ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;  
	    Блокировка.Заблокировать();
		
		МенеджерЗаписи = РегистрыСведений.ПроксиСервера_Приоритеты.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ПроксиСервер = ПроксиСервер;
		МенеджерЗаписи.Прочитать();

		ТекущийПриоритетПрокси = МенеджерЗаписи.ПриоритетТелеграм;
		НовыйПриоритетПрокси = ТекущийПриоритетПрокси + Дельта;

		Если НовыйПриоритетПрокси <= 0 Тогда 
		    НовыйПриоритетПрокси = 0;
		ИначеЕсли НовыйПриоритетПрокси > 999 Тогда // Приоритет может быть в диапазоне 0 - 999 
			НовыйПриоритетПрокси = 999;	
		КонецЕсли;	
		
		МенеджерЗаписи.ПроксиСервер = ПроксиСервер; // на случай если после чтения поле окажется пустым
		МенеджерЗаписи.ПриоритетТелеграм = НовыйПриоритетПрокси;
		МенеджерЗаписи.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ОписаниеОшибки = "Не удалось изменить приоритет прокси сервера. " + ОписаниеОшибки();
		ЗаписьВЖурналОшибок("ВебОбщий", "ИзменитьПриоритетПрокси", ОписаниеОшибки);		
	КонецПопытки;
	
	
КонецПроцедуры
